{"NPC": {"6": {"pk": 6, "name": "Gertrude Blackwood", "gender": "female", "race": "human", "desc": "Gertrude grew up in a poor family and had to learn how to survive on the streets through any means necessary. She became a skilled thief and con artist, using her friendly demeanor and patience to pull off and escape from risky situations. Despite her dishonest ways, she has a soft spot for those in need and often helps out the less fortunate in any way she can. Now in her old age, Gertrude spends most of her time at home, reminiscing about her wild youth and keeping to herself.", "personality": ["dishonest", "friendly", "patient"], "class_name": "rouge", "occupation": "retired thief and con artist", "age": 96, "inventory": ["lockpicks", "a small amount of gold"], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0}, "7": {"pk": 7, "name": "Ethel Green", "gender": "Female", "race": "Human", "desc": "Ethel was always a cunning and shrewd woman. She grew up in a poor family and quickly learned how to take advantage of situations to survive. As she got older, her dishonest tendencies only grew stronger, and she became quite skilled at lying and manipulating others. However, she is also careful and intuitive, always thinking ahead and making sure she doesn't get caught.", "personality": ["dishonest", "careful", "intuitive"], "class_name": "Rogue", "occupation": "Con artist", "age": 65, "inventory": ["Lockpick set", "Forgery kit", "Disguise kit", "Bag of fake currency"], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0}, "8": {"pk": 8, "name": "Kiera Blackwood", "gender": "female", "race": "human", "desc": "Kiera grew up in a small village but always dreamed of seeing the world beyond. She left home at a young age and quickly discovered a talent for sword fighting. Now, she travels from place to place selling her skills as a mercenary. Despite the danger of her job, Kiera maintains an optimistic outlook and always sees the adventure in every situation.", "personality": ["optimistic", "adventurous", "aggressive"], "class_name": "fighter", "occupation": "mercenary", "age": 34, "inventory": ["longsword", "chainmail armor", "adventurer's pack"], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0}, "14": {"pk": 14, "name": "Gertrude Williams", "gender": "female", "image": {"url": "", "asset_id": 0, "raw": null}, "race": "human", "desc": "Gertrude Williams was once a renowned healer throughout the land. However, as she aged, her compassion and kindness waned, replaced by bitterness and malice. Her patients now fear her and most avoid seeking her assistance. She spends her days cooped up in her cottage, bitter and angry.", "personality": ["careless", "mean", "serious"], "class_name": "Cleric", "occupation": "Retired Healer", "age": 93, "inventory": ["Staff", "Pouch of herbs"], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0}, "15": {"pk": 15, "name": "Matilda Fillmore", "gender": "Female", "image": {"asset_id": "5ae30a434c6a5e20f48352934cdd24ff", "url": "http://res.cloudinary.com/dzzdfujbf/image/upload/v1686597668/dnd/npcs/obwqbmfdt20wgs7xm0jv.png", "raw": null}, "race": "Human", "desc": "Matilda was born in a small village and lived a simple life. She always had a love for laughter and would do anything to put a smile on someone's face. She grew up to become a talented pastry chef and ran her own bakery for several years before retiring. Now in her golden years, she spends most of her time volunteering at the local shelter and sharing her baked goods with anyone who crosses her path.", "personality": ["Tolerant", "Silly", "Generous"], "class_name": "Commoner", "occupation": "Retired Pastry Chef", "age": 86, "inventory": ["Apron", "Baking Tools"], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0}, "16": {"pk": 16, "name": "Rachel Tackett", "gender": "Female", "image": {"url": "", "asset_id": 0, "raw": null}, "race": "Human", "desc": "Rachel grew up in a small farming town, where her parents taught her the values of hard work and generosity. Despite her humble upbringing, she always had a friendly and outgoing personality, and made friends easily. Rachel's generosity often got her in trouble with her parents, as she was always giving away food and supplies to those who were less fortunate. As she grew older, Rachel's desire to help others led her to become a cleric, and she now spends her days travelling from town to town, healing the sick and spreading joy wherever she goes.", "personality": ["Humble", "Friendly", "Generous"], "class_name": "Cleric", "occupation": "Healer", "age": 34, "inventory": ["Holy symbol", "Healer's kit", "Mace"], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0}}}