{"Player": {"1": {"pk": 1, "dnd_id": "77709222", "initiative": 0, "name": "Retta", "image": {"asset_id": "ba7ba86ca7f08b0c79d46028faa6cb59", "url": "http://res.cloudinary.com/dzzdfujbf/image/upload/v1686679535/dnd/players/wiatnipkusjzkrdzhmnh.jpg", "raw": null}, "ac": 15, "desc": "1248 DR\n\nWhen he looked back again, she was closer than he expected. She had been gaining on him for the last hour. It was a well-traveled road, but still, you never know with these kinds of people. In all likelihood, she was just another traveler who was in a bigger hurry than he was, but you can't be too careful.\nAgain, he glanced over his shoulder, and continued to do so every few minutes until she was within shouting distance. He started to pick up his pace, when she spoke:\n\"Hollo Stranger.\"\n\"Hello?\" The middle aged man's tone made clear that he had little interest in continuing the conversation.\n\"Are you headed to Berkeso? Want some company?\" The man looked at her with a mix of shock and muted aversion.\n\"Oh no, I'm sorry. I didn't mean THAT kind of company. Just someone to jabber to for the next day or so until we get to Berkeso, if that is where you’re going.\" As she got closer, the man studied the girl, trying to determine what kind of threat she was.\nOn her face, along with her dark eyes and reddish skin, sat a wide, closed mouthed smile. It made him feel a little bit more comfortable. As she bobbed her head, lazily glancing along the tree line, she seemed to take delight in the birds and small creatures that occasionally darted into view.\nOf course, her upbeat and lighthearted attitude stood in stark contrast to the woman's appearance. She had a lean, athletic figure. Despite the hood covering most of her head, she was clearly young, 20 at most. Of course, who doesn't have a nice figure at that age, thought the man.\n\"Tell me your name, friend. I promise I won't tell a soul.\" He gave her a sideways glance, and wondered if she was baiting him that kind of comment. Her face showed no awareness of his feelings on the matter.\n\"Marat.\"\n\"My name is Retta. It's more of a nickname because my real name is long. Too long to say all the time. Do you want to know my real name?\"\n\"Not particularly.\" Retta seemed unfazed by the rudeness, but then Marat had a thought. Despite the girl obviously being involved in some sort of criminal activity, she didn't seem interested in him and probably knew how to fight. If there was trouble between here and Berkeso, she would be useful. \"Uh, I mean, since we aren't going to be traveling together that long, we don't need to get into details. But if you want to talk until we get there, I guess I can listen. Just don't start talking that jibber jabber to me.\"\n\"Oh no, I don't even speak it. Once Mother disappeared, Father would never let us speak in those 'damnable words' again. That’s what he called them. He said that's what got her killed. I've pretty much forgotten it all now. \"\n\"I thought you said she disappeared?\" Marat thought he caught Retta in a lie.\n\"We don't know for sure. Father insisted something bad happened to her. But where we lived, nobody would have done anything, not to her at least. The people in our town loved her, in spite of, you know.\"\n\"So, she was like you? Your Father too? Not all of you are like that.\" The man blurted out. He immediately regretted it.\n\"Both my parents were. Father eventually just gave up. The town loved Mother, but no one really liked Father. He was always just a little too grumpy for them, and with how we look, people get the wrong idea. The town turned on him pretty fast. Eventually he couldn't leave the house without rocks and bottles being thrown at him.\n“I used to say all the time, 'Father, just smile and be nice. Its not that hard, and then they will like you.' But of course, he couldn’t, not after what happened to Mother. Eventually, he stopped leaving the house. Then stopped getting out of bed...But he made his choice, right? Nothing to be done about it.\"\n\"Um, yeah, I guess.\" Marat actually agreed with Retta, but it felt strange to hear it coming from her.\n\"I was 12 years old.” Retta continued unprompted, “It wasn't long before some of the townsfolk came along and ran me off so they could have my house for a 'better sort of people'. That's what they were saying to each other as they were chasing me away. My parents were poor, and also not exactly the right kind of people, know what I mean?\" Retta gave a sly wink.\n\"Uh, I don't know...I mean, no, you're...\" Marat stammered.\n\"It's okay. I know YOU aren't like that, but a lot of people are. I learned that pretty quick after living on the streets for a few weeks. I got caught a few times, but generally I’m faster than most, and had to get faster in order to survive. Of course, that only gets you out of so many scrapes.\" Across Retta's face flashed a moment of mingled anger and fear, but it was gone so fast Marat thought he imagined it.\n“This one time I got cornered by a group of men. They were yelling awful things at me, saying they were going to send me ‘back home’. They had every intention of it too. In fact, one of them was swinging his rusty old sword straight for my head when Nic came along and saved me. That's person I am going to see.\n“You should have seen it Marat. He took out 4 grown men with a waive of his hand. He didn't even look scared. ” Retta was waiving her arms around like she was fighting a horde of goblins, acting out the scene. She paused, a little out of breath. “At the time he looked so cool. Turns out, he's just kind of an asshole and doesn't get worked up about anything except his stupid books. And, of course, every man was drunk as skunks. But still, if he hadn't shown up, I wouldn't be here today to tell you this story.\"\n“He was a Warlock. You know what that is?\" Retta didn't even pause for him to answer, but Marat nodded anyway. \"And for some reason, he saw something in me. As you know, our kind often has similar ‘situations’ to Warlocks. My family has a similar, uh, ‘situation’. Luckily, our ‘situation’ doesn’t come with the same kind of obligations as Nic's. Our 'situation' gets passed down Mother to daughter, kinda like your blue eyes Marat. You probably got them from your Mother...wait, Father, right? Oh, wait, no details, right? Sorry.\nMarat stopped, \"I'm getting hungry. I'm going to stop and eat. You can wait, but I don't have extra, so please don't ask.\"\n\"Oh, that's fine. I actually have something for myself anyway. I would never expect anyone else to watch out for me. Not unless I returned the favor first, right?\" Retta plopped straight down on the dirt and opened her bag. Marat, on the other hand, found a mossy log just off the road and took out a blanket to lay over the log. He proceeded to lay out a meal of bread, cheese, and nuts.\n\"I just have dried meat. It's easier to carry and usually it's all I need.\" Retta grabbed a chunk of dried meat from her bag and began gnawing.\n\"I heard that about you...kind of...people...persons...\"\nRetta aimed a closed mouthed smile at Marat, \"It does have some benefits looking like me. It's great when I need information. Usually, people will just tell me whatever I want know just so I'll go away.\n\"Maybe that's why Nicodemus kept me with him,\" Retta wondered, speaking more to herself than Marat. \"He made sure I was fed and I was safe. Eventually he decided to start teaching me some things. Maybe he thought it would make me more useful to him. Or maybe he didn't want to keep looking after me, and if I could take care of myself, you know.\n“Once he thought I could handle myself, he started asking me to go on small errands. Usually to pick up books, sometimes other things.\" Marat glanced in her bag and saw 5 books poking out, each with old, leathery bindings. “I have been following his somber ass around ever since. I don't mean to sound ungrateful. Once you get past his apathy to pretty much everything except his books, he is a good man.\n“I owe him everything.” Retta reflected. “But of course, Nic never acted that way and he was always generous with what little he had. Not even when He was asking me to run all over mountains and forge rivers to find his stupid books. Nic showed me as much gratitude as he was capable of, you know, given his condition.\"\n\"Condition?\" Marat was actually getting drawn into her stories, but was having difficulty keeping track of the details.\n\"His pact with Mephistopheles.\"\n\"Meph..., oh my…, I...” Marat looked scared.\nRetta explained, \"See, there's this book, and it's a whole thing. I knew about it because...\" Retta gestures at herself and removes her hood to reveal two curled horns, small and jet black, \"well, we ‘persons’ pass that kind of information down in our families, even when we don't keep much else of our history.\"\nMarat shifted, nervous at the sight of her horns. Why do they have to shove it in your face, he thought?\n\"Nic actually suggested my name change, since most of us change our name when we reach adolescence. Nic's always good about respecting my heritage, even when I'm not. Then again, you know the sort of persons out type spends time with: thieves, rapists, and murderers. So maybe Nic’s a creep, who knows. I am drawn to those people. It’s just in my nature.\" Retta finally stopped talking and watched Marat for a long time, her expression giving away nothing.\n\"Well, I think I'll be heading down the road now. You can come along or not.\" Marat was trying to sound casual, but his tone had shifted. He began to pack up his things, placing them in his bag hurriedly, but for no particular reason he could understand.\nBefore he took his first step down the road, he felt a sudden coldness in his chest. He paused, a little stunned. At first he thought he felt pain, but then realized it was just cold, cold all the way through.\n\"See, like I said, people tell me things just to make me go away.” Retta whispered in his ear, moving up behind him with surprising speed. “All those errands I went on. I asked a lot of questions. I learned a lot of things.\" Retta's voice had changed from affable to pure grizzled hatred.\nMarat tried to struggle, but Retta put her hand firmly on his shoulder, \"I wouldn't do that. I currently have a ‘Dagger of Last Rites’ in your back. You can only use it once, and I've been saving it.”\nMarat froze. “You should know, if you move, you die. Also, when it comes out, you will die. In fact, nothing is going to save you now. I wanted to make sure you knew, your mind unclouded by pain or disfigurement, that you are all alone and will die in terror as I whisper hateful things in your ear. Just like you did to my mother.\"\nSuddenly Marat remembered that night. They were obviously evil, and yet everyone was suppose to tolerate them like they were just another race. It seemed like forever ago that she was talking that jibber-jabber. Marat had just had enough and wanted to teach one of them a lesson. She probably enjoyed being sent back where she belonged. Clearly this girl was better off without her lowlife parents. In some ways, it worked out for everyone. Marat almost said so out loud.\nRetta continued to whisper in a low, growling voice, \"I've been following you for a few years, always just behind you, missing you by a few days or hours. Imagine how amused I was when I found out your trail went right along my path. It really was very lucky that Nic got word to me to meet him in Berkeso.\n\"And you really do move around a lot Marat, but you know what? I don't care why. I don’t want to know your story. You may be a noble, priest, or criminal. I don't care. Your story doesn't matter. This is my story, and you are just the end of my first chapter.\"\n\"By the way, my full name is Retribution.\" Retta was no longer speaking in a whisper, and slowly pulled out the knife.\nMarat fell to the ground, eyes open to the sky. Retta kicked dirt in Marat's empty face before she continued down the road. She didn't bother to look in Marat's bag before she left. She got what she wanted, and she needed to get to Berkeso.", "race": "Tiefling", "speed": {"walk": 30, "fly": 0, "burrow": 0, "swim": 0, "climb": 0}, "class_name": "Warlock", "age": 19, "hp": 210, "wealth": {"cp": 0, "sp": 278, "gp": 3578, "ep": 0, "pp": 0}, "inventory": [{"name": "Glamoured Studded Leather", "description": "<p>While wearing this armor, you gain a +1 bonus to AC. You can also use a bonus action to speak the armor's command word and cause the armor to assume the appearance of a normal set of clothing or some other kind of armor. You decide what it looks like, including color, style, and accessories, but the armor retains its normal bulk and weight. The illusory appearance lasts until you use this property again or remove the armor.</p>"}, {"name": "Pearl of Power", "description": "<p>While this pearl is on your person, you can use an action to speak its command word and regain one expended spell slot. If the expended slot was of 4th level or higher, the new slot is 3rd level. Once you use the pearl, it can't be used again until the next dawn.</p>"}, {"name": "Rod of the Pact Keeper, +1", "description": "<p>While holding this rod, you gain a +1 bonus to spell attack rolls and to the saving throw DCs of your warlock spells.</p>\r\n<p>In addition, you can regain 1 warlock spell slot as an action while holding the rod. You can’t use this property again until you finish a long rest.</p>"}, {"name": "Crystal ball of refraction", "description": "<p>A cloudy crystal sphere that faintly glows with light, looking closely inside it you can see multitudes of refracted images in a swirling spiral. While attuned grants a +1 bonus to spell save DC, spell attack rolls and spell damage rolls. As an Action you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell.) The illusion appears in an unoccupied space that you can see within 30ft of you. As a bonus action on subsequent turns you can move the illusion up to 30ft to a space you can see, but it must remain within 120ft of you. For the duration you can cast spells as though you were in the illusion's space, but you must use your own senses. You gain the effect of the feat eldritch adept, but regardless of being a warlock you may not take an eldritch invocation that has any requirements.</p>"}, {"name": "Dagger", "description": "<p>Proficiency with a dagger allows you to add your proficiency bonus to the attack roll for any attack you make with it.</p>"}, {"name": "Backpack", "description": "<p>A backpack is a leather pack carried on the back, typically with straps to secure it. A backpack can hold&nbsp;1 cubic foot/ 30 pounds of gear.</p>\r\n<p>You can also strap items, such as a bedroll or a coil of rope, to the outside of a backpack.</p>"}, {"name": "Chest", "description": "<p>A chest can hold&nbsp;12 cubic feet/ 300 pounds of gear.</p>"}, {"name": "Rope, Hempen (50 feet)", "description": "<p>Rope,&nbsp;has 2 hit points and can be burst with a DC 17 Strength check.</p>"}, {"name": "Rope, Hempen (50 feet)", "description": "<p>Rope,&nbsp;has 2 hit points and can be burst with a DC 17 Strength check.</p>"}, {"name": "Oil of Etherealness", "description": "<p>Beads of this cloudy gray oil form on the outside of its container and quickly evaporate. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. The affected creature then gains the effect of the <strong></strong><strong>etherealness</strong> spell for 1 hour.</p>"}, {"name": "Tinderbox", "description": "<p>This small container holds flint, fire steel, and tinder (usually dry cloth soaked in light oil) used to kindle a fire. Using it to light a torch -- or anything else with abundant, exposed fuel -- takes an action. Lighting any other fire takes 1 minute.</p>\r\n<p>&nbsp;</p>"}, {"name": "Staff", "description": "<p>An arcane focus is a special item designed to channel the power of arcane spells. A sorcerer, warlock, or wizard can use such an item as a spellcasting focus, as described in&nbsp;the <span style=\"color: #47d18c;\"><a style=\"color: #47d18c;\" title=\"Arcane Focus\" href=\"https://www.dndbeyond.com/compendium/rules/basic-rules/spellcasting#MaterialM\">Spellcasting</a></span> section.</p>"}, {"name": "Dagger", "description": "<p>Proficiency with a dagger allows you to add your proficiency bonus to the attack roll for any attack you make with it.</p>"}, {"name": "Clothes, Common", "description": "<p>This set of clothes could consist of a loose shirt and baggy breeches, or a loose shirt and skirt or overdress. Cloth wrappings are used for shoes.</p>"}, {"name": "Crowbar", "description": "<p>Using a crowbar grants advantage to Strength checks where the crowbar's leverage can be applied.</p>"}, {"name": "Hammer", "description": "<p>This one-handed hammer with an iron head is useful for pounding pitons into a wall.</p>"}, {"name": "Holy Water (flask)", "description": "<p>As an action, you can splash the contents of this flask onto a creature within 5 feet of you or throw it up to 20 feet, shattering it on impact. In either case, make a ranged attack against a target creature, treating the holy water as an improvised weapon. If the target is a fiend or undead, it takes 2d6 radiant damage.</p>\r\n<p>A cleric or paladin may create holy water by performing a special ritual. The ritual takes 1 hour to perform, uses 25 gp worth of powdered silver, and requires the caster to expend a 1st-level spell slot.</p>"}, {"name": "Manacles", "description": "<p>These metal restraints can bind a Small or Medium creature. Escaping the manacles requires a successful DC 20 Dexterity check. Breaking them requires a successful DC 20 Strength check. Each set of manacles comes with one key. Without the key, a creature proficient with thieves' tools can pick the manacles' lock with a successful DC 15 Dexterity check. Manacles have 15 hit points.</p>"}, {"name": "Mirror, Steel", "description": "<p>A steel mirror is handy when you want to look around corners, signal friends with reflected sunlight, keep an eye on a medusa, make sure that you look good enough to present yourself to the queen, or examine wounds that you’ve received on hard-to-see parts of your body.</p>"}, {"name": "Oil (flask)", "description": "<p>Oil usually comes in a clay flask that holds 1 pint. As an action, you can splash the oil in this flask onto a creature within 5 feet of you or throw it up to 20 feet, shattering it on impact. Make a ranged attack against a target creature or object, treating the oil as an improvised weapon. On a hit, the target is covered in oil. If the target takes any fire damage before the oil dries (after 1 minute), the target takes an additional 5 fire damage from the burning oil. You can also pour a flask of oil on the ground to cover a 5-foot-square area, provided that the surface is level. If lit, the oil burns for 2 rounds and deals 5 fire damage to any creature that enters the area or ends its turn in the area. A creature can take this damage only once per turn.</p>"}, {"name": "Rations (1 day)", "description": "<p>Rations consist of dry foods suitable for extended travel, including jerky, dried fruit, hardtack, and nuts.</p>"}, {"name": "Rope, Hempen (50 feet)", "description": "<p>Rope,&nbsp;has 2 hit points and can be burst with a DC 17 Strength check.</p>"}, {"name": "Tinderbox", "description": "<p>This small container holds flint, fire steel, and tinder (usually dry cloth soaked in light oil) used to kindle a fire. Using it to light a torch -- or anything else with abundant, exposed fuel -- takes an action. Lighting any other fire takes 1 minute.</p>\r\n<p>&nbsp;</p>"}, {"name": "Torch", "description": "<p>A torch burns for 1 hour, providing bright light in a 20-foot radius and dim light for an additional 20 feet. If you make a melee attack with a burning torch and hit, it deals 1 fire damage.</p>"}, {"name": "Waterskin", "description": "<p>A waterskin can hold&nbsp;4 pints of liquid.</p>"}, {"name": "Flute", "description": "<p>If you have proficiency with a given musical instrument, you can add your proficiency bonus to any ability checks you make to play music with the instrument. A bard can use a musical instrument as a spellcasting focus.</p>"}, {"name": "Stake (Wooden)", "description": "<p>Stakes made out of wood, typically found in a monster hunter's pack.</p>"}, {"name": "Holy Symbol", "description": "<p>A holy symbol is a representation of a god or pantheon. A cleric or paladin can use a holy symbol as a spellcasting focus, as described in the&nbsp;<a href=\"https://www.dndbeyond.com/compendium/rules/basic-rules/spellcasting#MaterialM\" rel=\"nofollow\">Spellcasting</a>&nbsp;section. To use the symbol in this way, the caster must hold it in hand, wear it visibly, or bear it on a shield.</p>"}], "str": 12, "dex": 14, "con": 18, "wis": 14, "int": 14, "cha": 20, "features": {"Dark One’s Blessing": "When you reduce a hostile creature to 0 HP, you gain {{(modifier:cha+classlevel)@min:1#unsigned}} temp HP.", "Dark One’s Own Luck": "Once per short rest, when you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the roll but before the effects occur.", "Maddening Hex": "As a bonus action, you can deal {{modifier:cha}} psychic damage to the target cursed by your hex spell (or other cursing warlock feature) that you can see if it is within 30 ft, and also to creatures of your choice within 5 ft. of the cursed target.", "Lucky": "You have 3 luck points per long rest. Whenever you make an attack roll, an ability check, or a saving throw (or when an attack roll is made against you), you can spend one to roll an additional d20 and you choose which die to use. You can choose to spend luck points after you roll the die, but before the outcome is determined.", "Eldritch Spear": "When you cast eldritch blast, its range is 300 ft.", "Agonizing Blast": "When you cast eldritch blast, add {{modifier:cha}} to the damage it deals on a hit.", "Repelling Blast": "When you hit a creature with eldritch blast, you can push the creature up to 10 feet away from you in a straight line.", "Aspect of the Moon": "You no longer need to sleep and can’t be forced to sleep by any means, and you gain the benefits of a long rest while doing light activity.", "Pact of the Tome": "Your patron gives you a grimoire called a Book of Shadows that grants you additional cantrips that don't count against your number of cantrips known. If you lose the book, you can perform a 1-hour ceremony to receive a replacement during a short or long rest.", "Whispers of the Grave": "You can cast speak with dead at will, without expending a spell slot."}, "spells": {"Thaumaturgy": "<p>You manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range:</p>\r\n<ul>\r\n<li>Your voice booms up to three times as loud as normal for 1 minute.</li>\r\n<li>You cause flames to flicker, brighten, dim, or change color for 1 minute.</li>\r\n<li>You cause harmless tremors in the ground for 1 minute.</li>\r\n<li>You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.</li>\r\n<li>You instantaneously cause an unlocked door or window to fly open or slam shut.</li>\r\n<li>You alter the appearance of your eyes for 1 minute.</li>\r\n</ul>\r\n<p><br />If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.</p>", "Hellish Rebuke": "<p>You point your finger, and the creature that damaged you is momentarily surrounded by hellish flames. The creature must make a Dexterity saving throw. It takes 2d10 fire damage on a failed save, or half as much damage on a successful one.</p>\r\n<p><em><strong>At Higher Levels.</strong></em> When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st.</p>", "Darkness": "<p>Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it.</p>\r\n<p>If the point you choose is on an object you are holding or one that isn't being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.</p>\r\n<p>If any of this spell's area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.</p>", "Eldritch Blast": "<p>A beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 force damage.</p>\r\n<p>The spell creates more than one beam when you reach higher levels: two beams at 5th level, three beams at 11th level, and four beams at 17th level. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam.</p>", "Word of Radiance": "<p class=\"Core-Styles_Core-Body\">You utter a divine word, and burning radiance erupts from you. Each creature of your choice that you can see within range must succeed on a Constitution saving throw or take 1d6 radiant damage.</p>\r\n<p class=\"Core-Styles_Core-Body\">The spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>", "Message": "<p>You point your finger toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.</p>\r\n<p>You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell. The spell doesn't have to follow a straight line and can travel freely around corners or through openings.</p>", "Etherealness": "<p>You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away.</p>\r\n<p>While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren't on the Ethereal Plane can't perceive you and can't interact with you, unless a special ability or magic has given them the ability to do so.</p>\r\n<p>You ignore all objects and effects that aren't on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from.</p>\r\n<p>When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved.</p>\r\n<p>This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it, such as one of the Outer Planes.</p>\r\n<p><em><strong>At Higher Levels.</strong></em> When you cast this spell using a spell slot of 8th level or higher, you can target up to three willing creatures (including you) for each slot level above 7th. The creatures must be within 10 feet of you when you cast the spell.</p>", "Speak with Dead": "<p>You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead. The spell fails if the corpse was the target of this spell within the last 10 days.</p>\r\n<p>Until the spell ends, you can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive, and the corpse is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This spell doesn't return the creature's soul to its body, only its animating spirit. Thus, the corpse can't learn new information, doesn't comprehend anything that has happened since it died, and can't speculate about future events.</p>", "Dimension Door": "<p>You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45- degree angle, 300 feet.\"</p>\r\n<p>You can bring along objects as long as their weight doesn't exceed what you can carry. You can also bring one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell.</p>\r\n<p>If you would arrive in a place already occupied by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell fails to teleport you.</p>", "Raulothim's Psychic Lance": "<p>You unleash a shimmering lance of psychic power from your forehead at a creature that you can see within range. Alternatively, you can utter a creature’s name. If the named target is within range, it becomes the spell’s target even if you can’t see it. If the named target isn’t within range, the lance dissipates without effect.</p>\r\n<p>The target must make an Intelligence saving throw. On a failed save, the target takes 7d6 psychic damage and is incapacitated until the start of your next turn. On a successful save, the creature takes half as much damage and isn’t incapacitated.</p>\r\n<p><em><strong>At Higher Levels.</strong></em> When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 for each slot level above 4th.</p>", "Wall of Fire": "<p>You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration.</p>\r\n<p>When the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.</p>\r\n<p>One side of the wall, selected by you when you cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side or inside the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage.</p>\r\n<p><em><strong>At Higher Levels.</strong></em> When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.</p>", "Counterspell": "<p>You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect.</p>\r\n<p><strong>At Higher Levels.</strong> When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.</p>", "Crown of Madness": "<p>One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration.</p>\r\n<p>While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes. <br /><br />The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. The target can act normally on its turn if you choose no creature or if none are within its reach. <br /><br />On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the spell ends.</p>", "Earthbind": "<p>Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw, or its flying speed (if any) is reduced to 0 feet for the spell’s duration. An airborne creature affected by this spell safely descends at 60 feet per round until it reaches the ground or the spell ends.</p>", "Mage Hand": "<p>A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.</p>\r\n<p>You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.</p>\r\n<p>The hand can't attack, activate magic items, or carry more than 10 pounds.</p>", "Magic Stone": "<p>You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, it has a range of 60 feet. If someone else attacks with the pebble, that attacker adds your spellcasting ability modifier, not the attacker’s, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Hit or miss, the spell then ends on the stone.</p>\r\n<p>If you cast this spell again, the spell ends early on any pebbles still affected by it.</p>", "Dispel Magic": "<p>Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends.</p>\r\n<p><strong>At Higher Levels.</strong> When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used.</p>", "Green-Flame Blade": "<p>You brandish the weapon used in the spell’s casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack’s normal effects, and you can cause green fire to leap from the target to a different creature of your choice that you can see within 5 feet of it. The second creature takes fire damage equal to your spellcasting ability modifier.</p>\r\n<p>This spell’s damage increases when you reach certain levels. At 5th level, the melee attack deals an extra 1d8 fire damage to the target on a hit, and the fire damage to the second creature increases to 1d8 + your spellcasting ability modifier. Both damage rolls increase by 1d8 at 11th level (2d8 and 2d8) and 17th level (3d8 and 3d8).</p>", "Armor of Agathys": "<p>A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear. You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage.</p>\r\n<p><strong>At Higher Levels.</strong>&nbsp;When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot.</p>\r\n<p>&nbsp;</p>", "Hex": "<p>You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the spell. The target has disadvantage on ability checks made with the chosen ability.<br /><br />If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to curse a new creature.<br /><br />A remove curse cast on the target ends this spell early.</p>\r\n<p><strong>At Higher Levels.&nbsp;</strong>When you cast this spell using a spell slot of 3rd or 4th level, you can maintain your concentration on the spell for up to 8 hours. When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours.</p>", "Flame Strike": "<p>A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a Dexterity saving throw. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, or half as much damage on a successful one.</p>\r\n<p><strong>At Higher Levels.</strong> When you cast this spell using a spell slot of 6th level or higher, the fire damage or the radiant damage (your choice) increases by 1d6 for each slot level above 5th.</p>"}, "resistances": ["fire"]}, "2": {"pk": 2, "dnd_id": "77709222", "initiative": 0, "name": "", "image": {"url": "", "asset_id": 0, "raw": null}, "ac": 0, "desc": "", "race": "", "speed": {}, "class_name": "", "age": 0, "hp": 0, "wealth": [], "inventory": [], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0, "features": {}, "spells": {}, "resistances": []}, "3": {"pk": 3, "dnd_id": "77709222", "initiative": 0, "name": "", "image": {"url": "", "asset_id": 0, "raw": null}, "ac": 0, "desc": "", "race": "", "speed": {}, "class_name": "", "age": 0, "hp": 0, "wealth": [], "inventory": [], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0, "features": {}, "spells": {}, "resistances": []}, "4": {"pk": 4, "dnd_id": "77709222", "initiative": 0, "name": "", "image": {"url": "", "asset_id": 0, "raw": null}, "ac": 0, "desc": "", "race": "", "speed": {}, "class_name": "", "age": 0, "hp": 0, "wealth": [], "inventory": [], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0, "features": {}, "spells": {}, "resistances": []}, "5": {"pk": 5, "dnd_id": "77709222", "initiative": 0, "name": "", "image": {"url": "", "asset_id": 0, "raw": null}, "ac": 0, "desc": "", "race": "", "speed": {}, "class_name": "", "age": 0, "hp": 0, "wealth": [], "inventory": [], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0, "features": {}, "spells": {}, "resistances": []}, "6": {"pk": 6, "dnd_id": "77709222", "initiative": 0, "name": "", "image": {"url": "", "asset_id": 0, "raw": null}, "ac": 0, "desc": "", "race": "", "speed": {}, "class_name": "", "age": 0, "hp": 0, "wealth": [], "inventory": [], "str": 0, "dex": 0, "con": 0, "wis": 0, "int": 0, "cha": 0, "features": {}, "spells": {}, "resistances": []}}}